test/request-response-samples/Dummy__should_not_prefix_namespaces_when_using_extensions/request.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.Dummy.com" xmlns:n="http://www.Dummy.com/Name/Types" xmlns:msgsk="http://www.Dummy.com/Common/MessageSkeleton" xmlns:f="http://www.Dummy.com/Common/MessageHeader" xmlns:someFieldType="http://www.Dummy.com/Common/FieldType"><soap:Body><n:DummyRequest xmlns:n="http://www.Dummy.com/Name/Types"><header><ChildField xmlns:msgsk="http://www.Dummy.com/Common/MessageSkeleton">value for skeleton/childfield</ChildField></header><body>value for body</body></n:DummyRequest></soap:Body></soap:Envelope>