test/request-response-samples/Dummy__should_handle_attributes_in_request/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/>
<soap:Body>
		<ns1:DummyRequest xmlns:ns1="http://www.Dummy.com/Name/Types">
		<DummyField1 language="en-US">Humpty</DummyField1>
		<DummyFilter>
		<DummyStringFilter>Dumpty</DummyStringFilter>
		</DummyFilter>
		</ns1:DummyRequest>
</soap:Body>
</soap:Envelope>